ndom91/pinevoice-realtime-firmware/components/chip_bl606p/drivers/soc_std/bsp/std_drv/src/bl606p_i2c.c
        if (clk >= 100000) {
            GLB_Set_DSP_I2C1_CLK(1, 1, 1, 0);
            I2C_SetPrd(i2cNo, bclk / (clk * 4) - 1);
        } else if (clk >= 8000) {
            GLB_Set_DSP_I2C1_CLK(1, 1, 1, 9);
            I2C_SetPrd(i2cNo, bclk / 10 / (clk * 4) - 1);
        } else if (clk >= 800) {
            GLB_Set_DSP_I2C1_CLK(1, 1, 1, 99);
            I2C_SetPrd(i2cNo, bclk / 100 / (clk * 4) - 1);
        } else {
            GLB_Set_DSP_I2C1_CLK(1, 1, 1, 255);
            I2C_SetPrd(i2cNo, bclk / 256 / (clk * 4) - 1);
        }
    }
}

/****************************************************************************/ /**
 * @brief  I2C set scl sync
 *
 * @param  i2cNo: I2C ID type
 * @param  enable: Enable or disable I2C scl sync
 *
 * @return None
 *
*******************************************************************************/
void I2C_SetSclSync(I2C_ID_Type i2cNo, uint8_t enable)
{
    uint32_t tmpVal;
    uint32_t I2Cx = i2cAddr[i2cNo];

    /* Check the parameters */
    CHECK_PARAM(IS_I2C_ID_TYPE(i2cNo));

    tmpVal = BL_RD_REG(I2Cx, I2C_CONFIG);

    if (enable) {
        tmpVal = BL_SET_REG_BIT(tmpVal, I2C_CR_I2C_SCL_SYNC_EN);
    } else {
        tmpVal = BL_CLR_REG_BIT(tmpVal, I2C_CR_I2C_SCL_SYNC_EN);
    }

    BL_WR_REG(I2Cx, I2C_CONFIG, tmpVal);
}

/****************************************************************************/ /**
 * @brief  Get i2c busy state
 *
 * @param  i2cNo: I2C ID type
 *
 * @return RESET or SET
 *
*******************************************************************************/
BL_Sts_Type I2C_IsBusy(I2C_ID_Type i2cNo)
{
    uint32_t tmpVal;
    uint32_t I2Cx = i2cAddr[i2cNo];

    /* Check the parameters */
    CHECK_PARAM(IS_I2C_ID_TYPE(i2cNo));

    tmpVal = BL_RD_REG(I2Cx, I2C_BUS_BUSY);
    return ((BL_IS_REG_BIT_SET(tmpVal, I2C_STS_I2C_BUS_BUSY)) ? SET : RESET);
}

/****************************************************************************/ /**
 * @brief  Get i2c transfer end state
 *
 * @param  i2cNo: I2C ID type
 *
 * @return RESET or SET
 *
*******************************************************************************/
BL_Sts_Type I2C_TransferEndStatus(I2C_ID_Type i2cNo)
{
    uint32_t tmpVal;
    uint32_t I2Cx = i2cAddr[i2cNo];

    /* Check the parameters */
    CHECK_PARAM(IS_I2C_ID_TYPE(i2cNo));

    tmpVal = BL_RD_REG(I2Cx, I2C_INT_STS);
    return ((BL_IS_REG_BIT_SET(tmpVal, I2C_END_INT)) ? SET : RESET);
}

/****************************************************************************/ /**
 * @brief  I2C master write block data
 *
 * @param  i2cNo: I2C ID type
 * @param  cfg: I2C transfer config struct
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type I2C_MasterSendBlocking(I2C_ID_Type i2cNo, I2C_Transfer_Cfg *cfg)
{
    uint8_t i;
    uint32_t timeOut = 0;
    uint32_t temp = 0;
    uint32_t I2Cx = i2cAddr[i2cNo];

    /* Check the parameters */
    CHECK_PARAM(IS_I2C_ID_TYPE(i2cNo));

    I2C_Disable(i2cNo);
    I2C_Init(i2cNo, I2C_WRITE, cfg);
    I2C_Enable(i2cNo);

    /* Set I2C write data */
    for (i = 0; i < cfg->dataSize; i++) {
        temp += (cfg->data[i] << ((i % 4) * 8));

        if ((i + 1) % 4 == 0) {
            timeOut = I2C_FIFO_STATUS_TIMEOUT;

            while (BL_GET_REG_BITS_VAL(BL_RD_REG(I2Cx, I2C_FIFO_CONFIG_1), I2C_TX_FIFO_CNT) == 0) {
                timeOut--;

                if (timeOut == 0) {
                    I2C_Disable(i2cNo);
                    return TIMEOUT;
                }
            }

            BL_WR_REG(I2Cx, I2C_FIFO_WDATA, temp);
            temp = 0;
        }
    }

    if ((cfg->dataSize % 4) != 0) {
        timeOut = I2C_FIFO_STATUS_TIMEOUT;

        while (BL_GET_REG_BITS_VAL(BL_RD_REG(I2Cx, I2C_FIFO_CONFIG_1), I2C_TX_FIFO_CNT) == 0) {
            timeOut--;

            if (timeOut == 0) {
                I2C_Disable(i2cNo);
                return TIMEOUT;
            }
        }

        BL_WR_REG(I2Cx, I2C_FIFO_WDATA, temp);
    }

    timeOut = I2C_FIFO_STATUS_TIMEOUT;

    while (I2C_IsBusy(i2cNo) || !I2C_TransferEndStatus(i2cNo)) {
        timeOut--;

        if (timeOut == 0) {
            I2C_Disable(i2cNo);
            return TIMEOUT;
        }
    }

    I2C_Disable(i2cNo);
    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  I2C master read block data
 *
 * @param  i2cNo: I2C ID type
 * @param  cfg: I2C transfer config struct
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type I2C_MasterReceiveBlocking(I2C_ID_Type i2cNo, I2C_Transfer_Cfg *cfg)
{
    uint8_t i = 0;
    uint32_t timeOut = 0;
    uint32_t temp = 0;
    uint32_t I2Cx = i2cAddr[i2cNo];

    /* Check the parameters */
    CHECK_PARAM(IS_I2C_ID_TYPE(i2cNo));

    I2C_Disable(i2cNo);
    I2C_Init(i2cNo, I2C_READ, cfg);
    I2C_Enable(i2cNo);

    /* Read I2C data */
    while (cfg->dataSize - i >= 4) {
        timeOut = I2C_FIFO_STATUS_TIMEOUT;

        while (BL_GET_REG_BITS_VAL(BL_RD_REG(I2Cx, I2C_FIFO_CONFIG_1), I2C_RX_FIFO_CNT) == 0) {
            timeOut--;

            if (timeOut == 0) {
                I2C_Disable(i2cNo);
                return TIMEOUT;
            }
        }

        temp = BL_RD_REG(I2Cx, I2C_FIFO_RDATA);
        PUT_UINT32_LE(temp, cfg->data, i);
        i += 4;
    }

    if (i < cfg->dataSize) {
        timeOut = I2C_FIFO_STATUS_TIMEOUT;

        while (BL_GET_REG_BITS_VAL(BL_RD_REG(I2Cx, I2C_FIFO_CONFIG_1), I2C_RX_FIFO_CNT) == 0) {
            timeOut--;

            if (timeOut == 0) {
                I2C_Disable(i2cNo);
                return TIMEOUT;
            }
        }

        temp = BL_RD_REG(I2Cx, I2C_FIFO_RDATA);

        while (i < cfg->dataSize) {
            cfg->data[i] = (temp & 0xff);
            temp = (temp >> 8);
            i++;
        }
    }

    timeOut = I2C_FIFO_STATUS_TIMEOUT;

    while (I2C_IsBusy(i2cNo) || !I2C_TransferEndStatus(i2cNo)) {
        timeOut--;

        if (timeOut == 0) {
            I2C_Disable(i2cNo);
            return TIMEOUT;
        }
    }

    I2C_Disable(i2cNo);
    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  Mask/Unmask the I2C interrupt
 *
 * @param  i2cNo: I2C ID type
 * @param  intType: Specifies the interrupt type
 * @param  intMask: Enable/Disable Specified interrupt type
 *
 * @return None
 *
*******************************************************************************/
void I2C_IntMask(I2C_ID_Type i2cNo, I2C_INT_Type intType, BL_Mask_Type intMask)
{
    uint32_t tmpVal;
    uint32_t I2Cx = i2cAddr[i2cNo];

    /* Check the parameters */
    CHECK_PARAM(IS_I2C_ID_TYPE(i2cNo));
    CHECK_PARAM(IS_I2C_INT_TYPE(intType));
    CHECK_PARAM(IS_BL_MASK_TYPE(intMask));

